<script setup>
	const scrollToContent = () => {
		const content = document.querySelector('.content');
		if (content) {
			content.scrollIntoView({ behavior: 'smooth' });
		}
	};
</script>

<template>
	<div class="home">
		<header class="home__header header">
			<h1 class="header__slogan">
				کلینیکس، بزرگترین کلینیک آنلاین مدیریت و رزرو نوبت های پزشکی
			</h1>
			<h3 class="header__sub-slogan">همین الآن برای رزرو نوبت کلیک کنید</h3>
			<TheButton
				type="big"
				label="رزرو نوبت"
				width="100px"
				@click="scrollToContent"
			/>
		</header>
		<main class="home__content content">
			تمرین بخش فرانت اند طراحی و پیادهسازی وبسایت «CourseHub» شرح کلی هدف این
			تمرین، طراحی و پیادهسازی یک وبسایت آموزشی با نام «CourseHub» است. این
			سامانه به کاربران امکان میدهد که در آن ثبتنام و ورود نمایند، دورههای
			آموزشی مختلف را جستجو و رزرو کنند، پروفایل شخصی خود را مدیریت کنند و در
			بخش نقد و بررسی دورهها مشارکت داشته باشند . صفحات موردنیاز: . ۱ صفحه ورود
			و ثبتنام (Login & Signup) فرم ورود (Login): شامل فیلدهای ایمیل و رمز عبور
			. فرم ثبتنام (Signup): شامل ایمیل، رمز عبور، تأیید رمز عبور . اطلاعات
			کاربر پس از ثبتنام در LocalStorage ذخیره شود . اعتبارسنجی سمت کلاینت :
			تمامی ورودیها )ایمیل معتبر، حداقل طول رمز عبور و مطابقت رمز با تأیید رمز(
			باید پیش از ارسال بررسی شوند . . ۲ صفحه اصلی (Home Page) نوار جستجو برای
			دورهها، همراه با امکان انتخاب دستهبندی )مانند برنامهنویسی، طراحی،
			مارکتینگ( . بخش پیشنهادهای ویژه (Special Offers) نام درس: برنامهنویسی وب
			استاد درس: دکتر بلوریان پاییز ۴۰۵ - ۱۴۰۴ مهلت تحویل: ۲۵ آذر ۱۴۰۴ تمرین
			شماره ۱ دانشجویان محترم لطفاً به نکات زیر توجه کرده و آنها را رعایت
			فرمایید : ❖ تحویل تکلیف فقط از طریق سامانه VU امکانپذیر است . ❖ فقط یک
			فایل با فرمت ZIP و با نام StudentID-FullName-HWNumber.zip که در آن
			StudentID شماره دانشجویی، FullName نام و نام خانوادگی و HWNumber شماره
			تکلیف تحویلی است، بارگذاری شود . ❖ تحویل تکلیف بعد از مهلت مشخص شده نمرهای
			نخواهد داشت . ❖ در صورت مشابهت غیر معقول و کپی برداری، برای طرفین نمره صفر
			ثبت خواهد شد . نمایش دستهبندیهای محبوب به صورت کارتهای تصویری . نمایش لیست
			نقد و بررسیهای برتر کاربران . لین کهای دسترسی سریع: ورود، پشتیبانی، مشاهده
			پروفایل . . ۳ صفحه جستجوی دورهها (Course Search) نمایش لیست دورهها در قالب
			کارتهای واکنشگرا . فیلترها : قیمت، مدرس، سطح دوره )مبتدی، متوسط، پیشرفته(،
			زبان دوره . مرتبسازی : بر اساس امتیاز کاربران یا قیمت . عملیات فیلتر و
			مرتبسازی باید به کمک JavaScript در سمت کلاینت پیادهسازی شود . . ۴ صفحه
			جزئیات و رزرو دوره (Course Details & Reservation) نمایش اطلاعات کامل دوره
			شامل تصویر/لوگو، نام دوره، مدرس، مدتزمان، قیمت و امتیاز کاربران . فرم رزرو
			شامل: نام، شماره کارت تستی و تعداد صندلی . که پس از تکمیل اطلاعات، صرفاً
			پیام موفقیت » رزرو « دکمه (Success Message) نمایش دهد . اعتبارسنجی فرم :
			اطمینان از ورود اطلاعات کامل و صحیح )مثلاً شماره کارت باید فرمت معتبر
			داشته باشد( . . ۵ صفحه پروفایل کاربر (User Profile) نمایش اطلاعات شخصی:
			نام، ایمیل و شماره تماس . لیست رزروهای پیشین شامل نام دوره، تاریخ ثبتنام و
			وضعیت پرداخت . لیست تراکن شها شامل مبلغ، وضعیت و روش پرداخت . . ۶ صفحه نقد
			و بررسی دورهها (Course Reviews) فرم ارسال نظر شامل: انتخاب دوره، امتیاز
			)از ۱ تا ۵ ( و متن نظر . نمایش لیست نقد و بررسیها با امکان فیلتر بر اساس
			دوره . امکان کلیک روی هر نظر برای مشاهده جزئیات دوره مربوطه . تکنولوژ یها
			و مهارتهای مورد استفاده ➢ HTML / CSS : طراحی ساختار پایه و استایلدهی صفحات
			. ➢ Bootstrap : استفاده برای طراحی واکنشگرا (Responsive Design) ، فرمها،
			کارتها و جدولها . ➢ JavaScript : مدیریت دادهها در LocalStorage ، پیادهسازی
			فیلترها و مرتبسازی، و انجام اعتبارسنجی سمت کلاینت . ➢ React : استفاده از
			React Router برای مدیریت مسیرها و ساختار کامپوننتبندی شده صفحات . نکات
			کلیدی 1 . تمامی صفحات باید کاملاً واکنشگرا (Responsive) طراحی شوند تا در
			نمایشگرهای مختلف )موبایل، تبلت، دسکتاپ( بهدرستی نمایش داده شوند . 2 .
			اعتبارسنجی ورودیها در سمت کلاینت الزامی است؛ هیچ فرمی نباید بدون
			اعتبارسنجی ارسال شود . 3 . استفاده از تمام تکنولوژ یهای ذکرشده (HTML, CSS,
			Bootstrap, JavaScript, React) الزامی است . تمرین بخش فرانت اند طراحی و
			پیادهسازی وبسایت «CourseHub» شرح کلی هدف این تمرین، طراحی و پیادهسازی یک
			وبسایت آموزشی با نام «CourseHub» است. این سامانه به کاربران امکان میدهد که
			در آن ثبتنام و ورود نمایند، دورههای آموزشی مختلف را جستجو و رزرو کنند،
			پروفایل شخصی خود را مدیریت کنند و در بخش نقد و بررسی دورهها مشارکت داشته
			باشند . صفحات موردنیاز: . ۱ صفحه ورود و ثبتنام (Login & Signup) فرم ورود
			(Login): شامل فیلدهای ایمیل و رمز عبور . فرم ثبتنام (Signup): شامل ایمیل،
			رمز عبور، تأیید رمز عبور . اطلاعات کاربر پس از ثبتنام در LocalStorage
			ذخیره شود . اعتبارسنجی سمت کلاینت : تمامی ورودیها )ایمیل معتبر، حداقل طول
			رمز عبور و مطابقت رمز با تأیید رمز( باید پیش از ارسال بررسی شوند . . ۲
			صفحه اصلی (Home Page) نوار جستجو برای دورهها، همراه با امکان انتخاب
			دستهبندی )مانند برنامهنویسی، طراحی، مارکتینگ( . بخش پیشنهادهای ویژه
			(Special Offers) نام درس: برنامهنویسی وب استاد درس: دکتر بلوریان پاییز ۴۰۵
			- ۱۴۰۴ مهلت تحویل: ۲۵ آذر ۱۴۰۴ تمرین شماره ۱ دانشجویان محترم لطفاً به نکات
			زیر توجه کرده و آنها را رعایت فرمایید : ❖ تحویل تکلیف فقط از طریق سامانه
			VU امکانپذیر است . ❖ فقط یک فایل با فرمت ZIP و با نام
			StudentID-FullName-HWNumber.zip که در آن StudentID شماره دانشجویی،
			FullName نام و نام خانوادگی و HWNumber شماره تکلیف تحویلی است، بارگذاری
			شود . ❖ تحویل تکلیف بعد از مهلت مشخص شده نمرهای نخواهد داشت . ❖ در صورت
			مشابهت غیر معقول و کپی برداری، برای طرفین نمره صفر ثبت خواهد شد . نمایش
			دستهبندیهای محبوب به صورت کارتهای تصویری . نمایش لیست نقد و بررسیهای برتر
			کاربران . لین کهای دسترسی سریع: ورود، پشتیبانی، مشاهده پروفایل . . ۳ صفحه
			جستجوی دورهها (Course Search) نمایش لیست دورهها در قالب کارتهای واکنشگرا .
			فیلترها : قیمت، مدرس، سطح دوره )مبتدی، متوسط، پیشرفته(، زبان دوره .
			مرتبسازی : بر اساس امتیاز کاربران یا قیمت . عملیات فیلتر و مرتبسازی باید
			به کمک JavaScript در سمت کلاینت پیادهسازی شود . . ۴ صفحه جزئیات و رزرو
			دوره (Course Details & Reservation) نمایش اطلاعات کامل دوره شامل
			تصویر/لوگو، نام دوره، مدرس، مدتزمان، قیمت و امتیاز کاربران . فرم رزرو
			شامل: نام، شماره کارت تستی و تعداد صندلی . که پس از تکمیل اطلاعات، صرفاً
			پیام موفقیت » رزرو « دکمه (Success Message) نمایش دهد . اعتبارسنجی فرم :
			اطمینان از ورود اطلاعات کامل و صحیح )مثلاً شماره کارت باید فرمت معتبر
			داشته باشد( . . ۵ صفحه پروفایل کاربر (User Profile) نمایش اطلاعات شخصی:
			نام، ایمیل و شماره تماس . لیست رزروهای پیشین شامل نام دوره، تاریخ ثبتنام و
			وضعیت پرداخت . لیست تراکن شها شامل مبلغ، وضعیت و روش پرداخت . . ۶ صفحه نقد
			و بررسی دورهها (Course Reviews) فرم ارسال نظر شامل: انتخاب دوره، امتیاز
			)از ۱ تا ۵ ( و متن نظر . نمایش لیست نقد و بررسیها با امکان فیلتر بر اساس
			دوره . امکان کلیک روی هر نظر برای مشاهده جزئیات دوره مربوطه . تکنولوژ یها
			و مهارتهای مورد استفاده ➢ HTML / CSS : طراحی ساختار پایه و استایلدهی صفحات
			. ➢ Bootstrap : استفاده برای طراحی واکنشگرا (Responsive Design) ، فرمها،
			کارتها و جدولها . ➢ JavaScript : مدیریت دادهها در LocalStorage ، پیادهسازی
			فیلترها و مرتبسازی، و انجام اعتبارسنجی سمت کلاینت . ➢ React : استفاده از
			React Router برای مدیریت مسیرها و ساختار کامپوننتبندی شده صفحات . نکات
			کلیدی 1 . تمامی صفحات باید کاملاً واکنشگرا (Responsive) طراحی شوند تا در
			نمایشگرهای مختلف )موبایل، تبلت، دسکتاپ( بهدرستی نمایش داده شوند . 2 .
			اعتبارسنجی ورودیها در سمت کلاینت الزامی است؛ هیچ فرمی نباید بدون
			اعتبارسنجی ارسال شود . 3 . استفاده از تمام تکنولوژ یهای ذکرشده (HTML, CSS,
			Bootstrap, JavaScript, React) الزامی است .
		</main>
	</div>
</template>

<style lang="scss" scoped>
	.home {
		.header {
			background-color: var(--primary-900);
			width: 100%;
			height: space(200);
			@include flexbox(column, center, center, space(20));

			&__slogan {
				color: var(--text-900);
				animation: subtle-shake 3s infinite alternate ease;
				@include flexbox(row, center, center, space(0), wrap);
			}

			&__sub-slogan {
				color: var(--text-700);
			}

			@keyframes subtle-shake {
				0% {
					transform: translate(space(0), space(0));
				}
				25% {
					transform: translate(space(0), space(2));
				}
				50% {
					transform: translate(space(0), space(0));
				}
				75% {
					transform: translate(space(0), space(2));
				}
			}
		}

		.content {
			@include flexbox(column, center, right);
		}
	}
</style>
